TrebleStick/GravityRush/Hardware/ble_sdk_2_02_02_25/src/boards/CC2650RC/CC2650RC.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ====================== CC2650RC.c =========================================
 *  This file is responsible for setting up the board specific items for the
 *  CC2650 remote controle.
 */

/*
 *  ====================== Includes ============================================
 */
#include <stdint.h>
#include <stdbool.h>
#include <inc/hw_memmap.h>
#include <inc/hw_types.h>
#include <inc/hw_ints.h>
#include <driverlib/udma.h>
#include <driverlib/osc.h>
#include <driverlib/cpu.h>
#include <driverlib/pwr_ctrl.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/aon_event.h>
#include <driverlib/ioc.h>
#include <xdc/std.h>
#include <xdc/runtime/System.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>
#include <ti/drivers/dma/UDMACC26XX.h>
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>
#include <ti/drivers/timer/GPTimerCC26XX.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

#include "Board.h"
/*
 *  ========================= IO driver initialization =========================
 *  From main, PIN_init(BoardGpioInitTable) should be called to setup safe
 *  settings for this board.
 *  When a pin is allocated and then de-allocated, it will revert to the state
 *  configured in this table.
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(BoardGpioInitTable, ".const:BoardGpioInitTable")
#pragma DATA_SECTION(PINCC26XX_hwAttrs, ".const:PINCC26XX_hwAttrs")
#endif

const PIN_Config BoardGpioInitTable[] = {

    Board_LED_G       | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,     /* LED initially off            */
    Board_LED_R       | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,     /* LED initially off            */
    Board_LED_IR      | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,     /* LED initially off            */
    Board_BUZZER             | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* LED initially off           */
#ifdef APP_DEBUG_PINS
    Board_DEBUG_APP   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_DRVSTR_MAX,
#endif //APP_DEBUG_PINS
#ifdef  IRGENCC26XX_DEBUG
    Board_IR_DATA_CH_DEBUG   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW   | PIN_PUSHPULL | PIN_DRVSTR_MAX,
    Board_IR_SHADOW_CH_DEBUG | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW   | PIN_PUSHPULL | PIN_DRVSTR_MAX,
    Board_IR_OUTPUT_DEBUG    | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW   | PIN_PUSHPULL | PIN_DRVSTR_MAX,
#endif //IRGENCC26XX_DEBUG
    Board_MPU_INT            | PIN_INPUT_EN       | PIN_PULLDOWN       | PIN_IRQ_NEGEDGE | PIN_HYSTERESIS, /* MPU_INT is active low        */
    Board_MPU_POWER          | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH      | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* MPU initially on             */
    Board_MIC_POWER          | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MIN, /* MIC initially off            */
    Board_SPI_FLASH_CS       | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH      | PIN_PUSHPULL    | PIN_DRVSTR_MIN, /* External flash chip select   */
    Board_SPI_DEVPK_CS       | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MIN, /* DevPack chip select          */
    Board_KEY_COL1           | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* Col 1 is active low          */
    Board_KEY_COL2           | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* Col 2 is active low          */
    Board_KEY_COL3           | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* Col 3 is active low          */
    Board_KEY_PWR            | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* KEY PWR initially off        */
    Board_KEY_CLK            | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* KEY CLK initially off        */
    Board_KEY_SCAN           | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX, /* KEY SCAN initially low       */
    Board_I2C0_SDA1          | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW       | PIN_PUSHPULL    | PIN_DRVSTR_MAX,
    Board_UART_RX            | PIN_INPUT_EN       | PIN_PULLDOWN,                                          /* DevPack */
    Board_UART_TX            | PIN_INPUT_DIS      | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH   | PIN_PUSHPULL,   /* UART TX pin at inactive level */
    Board_SPI0_MOSI          | PIN_INPUT_EN       | PIN_PULLDOWN,                                            /* SPI master out - slave in */
    Board_SPI0_MISO          | PIN_INPUT_EN       | PIN_PULLDOWN,                                            /* SPI master in - slave out */
    Board_SPI0_CLK           | PIN_INPUT_EN       | PIN_PULLDOWN,                                             /* SPI clock */
    Board_DEVPK_ID           | PIN_INPUT_EN       | PIN_NOPULL,                                            /* Device pack ID - external PU  */
    PIN_TERMINATE                                                                              /* Terminate list               */
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

